Source/InformationRegisters/GigaChat_ТокеныАвторизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>GigaChat_ТокеныАвторизации</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Токен</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторТокена</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Source/CommonModules/GigaChat_Сервер/Ext/Module.bsl
#Область ЛокальныеФункции 

Функция ВставитьПараметры(Адрес,Параметры)
	Адрес = Адрес + "?";
	Для Каждого Стр Из Параметры Цикл
		Адрес = Адрес + "&" + Стр.Ключ + "=" + Стр.Значение;
	КонецЦикла;
	Возврат Адрес;
КонецФункции
//
Функция ПолучитьСоединение(Хост = Неопределено,Порт = Неопределено)
	ЗС = Новый ЗащищенноеСоединениеOpenSSL();
	//
	Если Хост <> Неопределено И Порт <> Неопределено Тогда
		HTTPСоединение = Новый HTTPСоединение(Хост,Порт,,,,,ЗС,);
	Иначе
		HTTPСоединение = Новый HTTPСоединение("gigachat.devices.sberbank.ru",,,,,,ЗС,);	
	КонецЕсли;
	//
	Возврат HTTPСоединение;
КонецФункции
//
Функция ПолучитьЗаголовки()
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Authorization","Bearer "+"");
	Заголовки.Вставить("Content-Type","application/json");
	Возврат Заголовки;
КонецФункции
//
Функция ОбработатьОтвет(Ответ)
	Если Ответ.КодСостояния = 200 Или Ответ.КодСостояния = 204 Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции
//
Функция УбратьРазделители(Стр)
	Если Стр <> Неопределено Тогда
		Врем = Строка(Стр);
		Врем = СтрЗаменить(Врем,",","");
		Врем = СтрЗаменить(Врем,".","");
		Врем = СтрЗаменить(Врем,"'","");
		Возврат Врем;
	Иначе
		Возврат Стр;
	КонецЕсли;
КонецФункции
//
Функция ПолучитьJSONФайл(ДанныеТела)
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("json");
	ЗаписьJSON = Новый ЗаписьJSON; 
	ЗаписьJSON.ОткрытьФайл(ИмяВременногоФайла);
	ЗаписатьJSON(ЗаписьJSON, ДанныеТела,Новый НастройкиСериализацииJSON); 
	ЗаписьJSON.Закрыть();
	Возврат ИмяВременногоФайла;
КонецФункции

#Область Авторизация

Процедура ЗаписатьТокенВбазу(Токен = Неопределено)
	МенеджерЗаписи = РегистрыСведений.GigaChat_ТокеныАвторизации.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = ТекущаяДата();
	МенеджерЗаписи.ИдентификаторТокена = Новый УникальныйИдентификатор;
	МенеджерЗаписи.Токен = Токен;
	МенеджерЗаписи.Записать();
КонецПроцедуры

Процедура ОбновитьТокенАвторизации()
	Соединение = ПолучитьСоединение("ngw.devices.sberbank.ru",9443);
	//
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Authorization","Bearer " + ПолучитьАвторизационныеДанные());
	Заголовки.Вставить("Content-Type","application/x-www-form-urlencoded");
	Заголовки.Вставить("Accept","*/*");
	Заголовки.Вставить("Accept-Encoding","gzip, deflate, br");
	Заголовки.Вставить("Connection","keep-alive");
	Заголовки.Вставить("RqUID","6f0b1291-c7f3-43c6-bb2e-9f3efb2dc98e");
	//
	Параметры = Новый Соответствие;
	//
	HTTPЗапрос = Новый HTTPЗапрос(ВставитьПараметры("/api/v2/oauth",Параметры),Заголовки);
	HTTPЗапрос.УстановитьТелоИзСтроки("scope=GIGACHAT_API_PERS");
	Ответ = Соединение.ВызватьHTTPМетод("POST",HTTPЗапрос);
	Если Ответ.КодСостояния = 200 Тогда
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(Ответ.ПолучитьТелоКакСтроку());
		ДанныеJSON = ПрочитатьJSON(ЧтениеJSON);
		ЧтениеJSON.Закрыть();
		//
		ЗаписатьТокенВбазу(ДанныеJSON.access_token);
	Иначе
		//
	КонецЕсли;
	//TODO: Запись в лог результат
КонецПроцедуры

Функция ПолучитьАвторизационныеДанные()
	Возврат "MzljOWFkNDItMGJmNy00NmUxLWJiZTUtMmM2MzhhZjhkNjIwOmRkYTdkMTQ2LWI5OGQtNDQwOC05OWZhLTYxY2Q0YjQ2MTNiNg==";
КонецФункции

Функция ПолучитьАктуальныйТокен() Экспорт
	Период = Неопределено;
	Токен = Неопределено;
	//
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	GigaChat_ТокеныАвторизацииСрезПоследних.ИдентификаторТокена КАК ИдентификаторТокена,
	               |	GigaChat_ТокеныАвторизацииСрезПоследних.Токен КАК Токен,
	               |	GigaChat_ТокеныАвторизацииСрезПоследних.Период КАК Период
	               |ИЗ
	               |	РегистрСведений.GigaChat_ТокеныАвторизации.СрезПоследних КАК GigaChat_ТокеныАвторизацииСрезПоследних
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	GigaChat_ТокеныАвторизацииСрезПоследних.Период УБЫВ";
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ОбновитьТокенАвторизации();
		//
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		               |	GigaChat_ТокеныАвторизацииСрезПоследних.Токен КАК Токен
		               |ИЗ
		               |	РегистрСведений.GigaChat_ТокеныАвторизации.СрезПоследних КАК GigaChat_ТокеныАвторизацииСрезПоследних
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	GigaChat_ТокеныАвторизацииСрезПоследних.Период УБЫВ";
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			Токен = Неопределено;
		Иначе
			ВыборкаЗапроса = РезультатЗапроса.Выбрать();
			Пока ВыборкаЗапроса.Следующий() Цикл
				Токен = ВыборкаЗапроса.Токен;
			КонецЦикла;
		КонецЕсли;
	Иначе
		ВыборкаЗапроса = РезультатЗапроса.Выбрать();
		Пока ВыборкаЗапроса.Следующий() Цикл
			Период = ВыборкаЗапроса.Период;
			Токен = ВыборкаЗапроса.Токен;
		КонецЦикла;
		//
		Если ТекущаяДата() >= (Период + 1800)  Тогда
			ОбновитьТокенАвторизации();
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
			               |	GigaChat_ТокеныАвторизацииСрезПоследних.Токен КАК Токен
			               |ИЗ
			               |	РегистрСведений.GigaChat_ТокеныАвторизации.СрезПоследних КАК GigaChat_ТокеныАвторизацииСрезПоследних
			               |
			               |УПОРЯДОЧИТЬ ПО
			               |	GigaChat_ТокеныАвторизацииСрезПоследних.Период УБЫВ";
			РезультатЗапроса = Запрос.Выполнить();
            ВыборкаЗапроса = РезультатЗапроса.Выбрать();
			Пока ВыборкаЗапроса.Следующий() Цикл
				Токен = ВыборкаЗапроса.Токен;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	//
	Возврат Токен;
КонецФункции

#КонецОбласти

#КонецОбласти

#Область ГлобальныеФункции

#КонецОбласти

//https://www.youtube.com/watch?v=QrV_zhnKz6A&list=PL9PLUrw0CbcSPQtPDruzw2NXjqQcSCZ91&index=2
//https://www.youtube.com/watch?v=fSZvkr21dqk&list=PL9PLUrw0CbcSPQtPDruzw2NXjqQcSCZ91&index=6
